// Задача 1 Виведіть в консоль числа від 1 до n використовуючи цикл for. (Дано: n = 10)

// let n = 10;
// for (i = 1; i <= n; i++) {
//   console.log(i);
// }

// Задача 2 Напишіть цикл, який обчислює суму чисел від 1 до n. (Дано: n = 100)

// let n = 100;
// let sum = 0;
// for (i = 1; i <= n; i++) {
//   sum += i;
// }
// console.log(sum);

// Задача 3 Використовуючи цикл while, виведіть в консоль числа від n до 1. (Дано: n = 10)

// let n = 10;
// while (n > 0) {
//   console.log(n);
//   n--;
// }

// Задача 4 Напишіть цикл, який виводить всі парні числа від 1 до n. (Дано: n = 50)

// let n = 50;
// for (i = 1; i <= n; i++) {
//   if (i % 2 == 0) {
//     console.log(i);
//   }
// }

// Задача 5 Виведіть в консоль таблицю множення від 1 до n використовуючи вкладені цикли. (Дано: n = 10)

// let n = 10;
// for (let i = 1; i <= n; ++i) {
//   console.log(`таблица умножение на ${i} `);
//   for (j = 1; j <=n; j++) {
//     let k = j * i;
//     console.log(` ${i} * ${j} = ${k}`);
//   }
// }

// Задача 6 Обчисліть факторіал числа n, використовуючи цикл. (Дано: n = 7)

// let n = 7;
// let factorial = 1;
// for (i = 1; i <= n; i++) {
//   factorial *= i;
// }
// console.log(factorial);

// задача 7 Виведіть перші n чисел послідовності Фібоначчі. (Дано: n = 10)

// let num1 = 0;
// let num2 = 1;
// for (let fn = 10; fn >= 1; fn--) {
//   let sum = num1 + num2;
//   num1 = num2;
//   num2 = sum;
//   console.log(sum);
// }

//задача 8 Виведіть всі прості числа від 1 до n. (Дано: n = 100)

// let n = 100;
// nextPrime:
// for ( let i = 1; i <= n; i++) {
//     for (let j = 2; j < i; j++) {
//       if (i % j == 0) continue nextPrime;
//     }
//     console.log(i);
//   }
//задача 9 Створіть масив чисел від 1 до n, а потім виведіть тільки ті числа, що діляться на 5 без остачі. (Дано: n = 100)

// let n = 100;
// let array = [];
// for(let i = 1;i <= n;i++){
//     array.push(i);
//     if(i%5===0){
//         console.log(i);
//     }
// }

//задача 10 Дано масив чисел. Обчисліть суму чисел в цьому масиві. (Дано: масив = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10])

// let myArr = [1,2,3,4,5,6,7,8,9,10];
// sumOfArr = 0;
// for(let i =0;i<myArr.length;i++){
//     sumOfArr += myArr[i];
//     console.log(sumOfArr);

// }


